{
  "showInMenu": true,
  "title": "Historik",
  "body": [
    {
      "type": "text",
      "body": "Vinköls socken är en plats med djupa historiska rötter, vars rika förflutna har vävts samman genom århundradenas gång. Dess omfattande historia har dokumenterats och bevarats för framtida generationer, bland annat i den välkända ”Vinkölsboken”. Denna bok är en skattkista av kunskap, som erbjuder en detaljerad inblick i bygdens forna liv och tider, dess människor och deras vardag. För de som önskar fördjupa sig ytterligare i denna fascinerande historia, huserar Skara museum en samling av fotografier som ger liv åt berättelserna från Vinköls forntid.\n\nOmrådet kring Vinköl är rikt på fornlämningar, tysta vittnen till en svunnen era. Dessa historiska avtryck berättar om en tid långt före vår egen och erbjuder en unik inblick i våra förfäders liv. Men historien här är inte enbart forntida; skogarna och markerna bär även spår av mer modern historia. Vandra genom dessa skogar, och du kommer att stöta på rester av torp och små gårdar, som trots att de var bebodda för så lite som 70 år sedan, nu har återupptagits av naturen och förfallit till ruiner. Dessa tysta lämningar är påminnelser om en inte alltför avlägsen tid då landsbygden var ett myller av liv och aktivitet.\n\nVinköls bygd erbjuder därmed en unik möjlighet att utforska en levande historia, från de forntida ristningarna och gravhögarna som berättar om en mystisk forntid, till de övergivna torpen som vittnar om en senare era av förändring och utveckling. Varje steg genom denna landskap är en resa genom tiderna, och vi inbjuder er att utforska och uppleva rikedomen i Vinköls historiska arv."
    },
    {
      "type": "gallery",
      "images": [
        {
          "type": "image",
          "image": "/images/history-1.png",
          "alt": "Bild 1"
        },
        {
          "type": "image",
          "image": "/images/history-2.png",
          "alt": "Bild 2"
        },
        {
          "type": "image",
          "image": "/images/history-3.png",
          "alt": "Bild 3"
        }
      ]
    }
  ]
}