{
  "showInMenu": true,
  "title": "Skötsel",
  "order": 4,
  "body": [
    {
      "type": "columns",
      "leftAlign": "left",
      "rightAlign": "left",
      "right": [
        {
          "type": "text",
          "heading": "Gräsklippningsschema",
          "body": "Kommer snart"
        },
        {
          "type": "text",
          "body": "Med vårens ankomst och sommarens värme följer en lummig grönska runt vår kära bygdegård. Gräsmattorna frodas, vilket innebär att det är dags för gräsklippning. För att hålla våra utomhusytor inbjudande och välskötta vänder vi oss nu till er, vår fantastiska gemenskap, med en vänlig förfrågan om hjälp.\n\n**Så här kan du bidra:**  \nVi har satt upp ett gräsklippningsschema och skulle uppskatta all hjälp vi kan få. Om du har möjlighet och vill bidra till att vår bygdegård ser sitt bästa ut, kontakta oss gärna. Varje par hjälpande händer gör en stor skillnad.\n\n**Kontakta oss:**  \n- **E-post:** vinkolsbygdegard@gmail.com  \n- **Telefon:** Ring Fredrik Bengtsson på 0511-37 40 15.\n\nFör att underlätta planeringen av evenemang och minska risken för att gräs dras in i lokalen, föreslår vi att gräsklippning sker tidigt i veckan. Detta säkerställer att vår bygdegård är i toppskick för helgens festligheter, samtidigt som det ger en trevlig miljö för alla besökare.\n\nVi ser fram emot ditt engagemang och tackar på förhand för din värdefulla insats!",
          "heading": "Hjälp Behövs med Gräsklippningen"
        }
      ],
      "left": [
        {
          "type": "text",
          "body": "Vi behöver hjälp med att städa bygdegården både inne och ute, och det gör vi på våren och på hösten när de flesta av löven släppt från träden.",
          "heading": "Säsongsstädning"
        },
        {
          "type": "text",
          "heading": "Vårstäd, 21 april",
          "body": "Vårstädningen görs den 21 april kl 9:00"
        },
        {
          "type": "text",
          "heading": "Höststäd, 26 oktober",
          "body": "Den 26 oktober kl 9:00 blir det höststädning."
        }
      ],
      "heading": ""
    }
  ]
}